Repository: schulle4u/sivvy
Catalog: sivvy/locale/*/LC_MESSAGES/sivvy.po
Languages: de

source: Filename cannot be empty.
de: Dateiname darf nicht leer sein.

source: Invalid characters in filename: %(chars)s
de: Ungültige Zeichen im Dateinamen: %(chars)s

source: '%(name)s' is a reserved filename.
de: '%(name)s' ist ein reservierter Dateiname.

source: Filename is too long (maximum 255 characters).
de: Dateiname zu lang (maximal 255 Zeichen).

source: Filename cannot consist only of dots.
de: Dateiname darf nicht nur aus Punkten bestehen.

source: Press Enter to continue...
de: Fortfahren mit Enter...

source: Status Messages:
de: Statusmeldungen:

source: (Showing last 5 messages - enter 's' to see all)
de: (Die letzten 5 Meldungen werden angezeigt - 's' eingeben um alle anzuzeigen)

source: all
de: alle

source: recent
de: neueste

source: Message display mode: %(mode)s
de: Anzeigemodus: %(mode)s

source: Please enter column names separated by commas.
de: Bitte Spaltennamen durch Kommas getrennt eingeben.

source: Column names:
de: Spaltennamen:

source: No column names entered. Using default headers.
de: Keine Spaltennamen eingegeben. Standardspalten werden verwendet.

source: Warning: Invalid output format '%(format)s' entered. Falling back to default format 'simple'.
de: Warnung: Ungültiges Ausgabeformat '%(format)s'. Das Standardformat 'simple' wird verwendet.

source: File '%(file)s' is empty. Please enter column names:
de: Datei '%(file)s' ist leer. Bitte Spaltennamen eingeben:

source: Created empty new file '%(file)s' with headers.
de: Leere neue Datei '%(file)s' mit Spaltenköpfen erstellt.

source: Using manually set delimiter: %(delimiter)s
de: Verwende manuell gesetztes Trennzeichen: %(delimiter)s

source: Loaded file '%(file)s' with %(rows)s rows.
de: Datei '%(file)s' mit %(rows)s Zeilen geladen.

source: File exists but appears to be empty after reading.
de: Datei existiert, scheint nach dem Lesen aber leer zu sein.

source: File '%(file)s' not found. Creating a new file.
de: Datei '%(file)s' nicht gefunden. Eine neue Datei wird erstellt.

source: Permission denied: Cannot access file '%(file)s'.
de: Berechtigung verweigert: Auf Datei '%(file)s' kann nicht zugegriffen werden.

source: File encoding error: %(error)s. Trying different encoding...
de: Dateikodierungsfehler: %(error)s. Versuche eine andere Kodierung...

source: Detected delimiter: %(delimiter)s
de: Trennzeichen erkannt: %(delimiter)s

source: Could not detect delimiter automatically: %(error)s. Using comma (,).
de: Trennzeichen konnte nicht automatisch erkannt werden: %(error)s. Verwende Komma (,).

source: Unexpected error during delimiter detection: %(error)s. Using comma (,).
de: Unerwarteter Fehler bei der Trennzeichenerkennung: %(error)s. Verwende Komma (,).

source: Trying encoding: %(encoding)s
de: Versuche Kodierung: %(encoding)s

source: Successfully loaded with encoding %(encoding)s.
de: Erfolgreich mit Kodierung %(encoding)s geladen.

source: Error with encoding %(encoding)s: %(error)s
de: Fehler mit der Kodierung%(encoding)s: %(error)s

source: Could not read file with any supported encoding. File may be corrupted.
de: Die Datei konnte mit keiner unterstützten Kodierung geladen werden. Möglicherweise ist sie defekt.

source: Saved changes in '%(file)s'.
de: Änderungen in '%(file)s' gespeichert.

source: Error saving '%(file)s': %(error)s
de: Fehler beim Speichern von '%(file)s': %(error)s

source: An unexpected error occurred while saving: %(error)s
de: Unerwarteter Fehler beim Speichern: %(error)s

source: Displaying rows %(start)s to %(end)s
de: Die Zeilen %(start)s bis %(end)s werden angezeigt

source: Invalid or empty display range. Loading the entire file.
de: Ungültiger oder leerer Anzeigebereich. Die gesamte Datei wird geladen.

source: Index
de: Zeile

source: The current table's output was exported to file '%(file)s'.
de: Die aktuelle Tabellenansicht wurde in Datei '%(file)s' exportiert.

source: Editing column headers
de: Bearbeite Spaltenköpfe

source: Enter new values. Leave empty to retain the current value.
de: Neue Werte eingeben, leer lassen um den aktuellen wert zu behalten.

source: Column %(num)s (current: '%(current)s'):
de: Spalte %(num)s (aktuell: '%(current)s'):

source: Column headers have been updated.
de: Spaltenköpfe wurden aktualisiert.

source: Row index %(index)s is higher than the maximum number of rows (%(maxrows)s).
de: Zeilenindex %(index)s ist höher als die maximale Zeilenanzahl (%(maxrows)s).

source: Should the gap be filled with %(rows)s empty rows?
de: Soll die Lücke mit %(rows)s leeren Zeilen aufgefüllt werden?

source: Added %(rows)s empty rows.
de: %(rows)s leere Zeilen eingefügt.

source: Adding new row %(index)s.
de: Erstelle neue Zeile %(index)s.

source: Editing row %(index)s
de: Bearbeite Zeile %(index)s

source: %(header)s (current: '%(current)s'):
de: %(header)s (aktuell: '%(current)s'):

source: Row %(index)s has been updated.
de: Zeile %(index)s wurde aktualisiert.

source: Invalid row index %(index)s. Valid range: 1-%(max)s
de: Ungültiger Zeilenindex %(index)s. Gültiger Bereich: 1-%(max)s

source: Deleting row %(index)s
de: Lösche Zeile %(index)s

source: Delete this row?
de: Diese Zeile löschen?

source: Row %(index)s deleted successfully.
de: Zeile %(index)s erfolgreich gelöscht.

source: Aborted.
de: Abbruch.

source: Displaying row %(index)s
de: Betrachte Zeile %(index)s

source: Table export
de: Tabellenexport

source: This function exports the current table view as a text file in the program's directory.
de: Diese Funktion exportiert die aktuelle Tabellenansicht als Textdatei in das Programmverzeichnis.

source: Enter the desired file name, press Enter for the default file name 'sivvy_output.txt' or 'c' to cancel.
de: Bitte den gewünschten Dateinamen eingeben, Eingabetaste für den Standarddateinamen 'sivvy_output.txt' oder 'c' um abzubrechen.

source: Export filename (default: 'sivvy_output.txt'):
de: Export-Dateiname (Standard: 'sivvy_output.txt'):

source: Please enter a valid filename.
de: Bitte einen gültigen Dateinamen eingeben.

source: File '%(file)s' already exists. Overwrite?
de: Datei '%(file)s' ist bereits vorhanden. Überschreiben?

source: Include row index in export?
de: Zeilenindex in Export einbeziehen?

source: Invalid split command. Usage: <command> <row_number>
de: Ungültiger Teilbefehl. Verwendung: <Befehl> <Zeilennummer>

source: Row number must be positive.
de: Zeilennummer muss positiv sein.

source: Invalid row number: %(number)s
de: Ungültige Zeilennummer: %(number)s

source: No deleted rows to restore.
de: Keine gelöschten Zeilen zum Wiederherstellen.

source: Undo History
de: Wiederherstellungsverlauf

source: Row
de: Zeile

source: Enter number to restore (or press Enter to cancel):
de: Nummer zum Wiederherstellen eingeben, Abbruch mit Enter:

source: Invalid choice. Please enter a number between 1 and %(max)s
de: Ungültige Auswahl. Bitte eine Zahl zwischen 1 und %(max)s eingeben

source: Restoring row:
de: Zeile wiederherstellen:

source: Restore at position (1-%(max)s, or Enter for original position %(orig)s):
de: An Position wiederherstellen (1-%(max)s, oder Enter für die Ursprungsposition %(orig)s):

source: Invalid position. Using original position.
de: Ungültige Position. Die Ursprungsposition wird verwendet.

source: Row restored at position %(pos)s
de: Zeile an Position %(pos)s wiederhergestellt

source: Invalid input. Please enter a number.
de: Ungültige Eingabe. Bitte eine Zahl eingeben.

source: Error during undo: %(error)s
de: Fehler beim Wiederherstellen: %(error)s

source: Welcome to Sivvy!
de: Willkommen bei Sivvy!

source: Command ('h' for help):
de: Befehl ('h' für Hilfe):

source: Exit and save changes
de: Beenden und Änderungen speichern

source: Status messages cleared.
de: Statusmeldungen gelöscht.

source: Help
de: Hilfe

source: The following commands are available:
de: Folgende Befehle sind verfügbar:

source: - Enter row number to edit (0 for headers)
de: - Zeilenindex zum Bearbeiten eingeben (0 für Spaltenköpfe)

source: - 'd <row_number>' to delete a row
de: - 'd <Zeilennummer>' zum Löschen einer Zeile

source: - 'u' to undo/restore deleted rows
de: - 'u' zum Wiederherstellen gelöschter Zeilen

source: - 'v <row_number>' to display a row in a more detailed view
de: - 'v <Zeilennummer>' für die Detailansicht einer Zeile

source: - 'e' to export current table view as a file
de: - 'e' zum Exportieren der aktuellen Tabelle als Datei

source: - 's' to toggle status message display
de: - 's' zum Umschalten der Statusmeldungsanzeige

source: - 'c' to clear status messages
de: - 'c' zum Bereinigen der Statusmeldungen

source: - 'q' to exit
de: - 'q' zum Beenden

source: Invalid row index. Please enter a positive value or 0 for headers.
de: Ungültiger Zeilenindex. Bitte einen positiven Wert eingeben oder 0 für die Spaltenköpfe.

source: Invalid input. Please enter a number, '0' for headers, or 'q' to exit.
de: Ungültige Eingabe. Bitte eine Zahl eingeben, '0' für die Spaltenköpfe, oder 'q' zum Beenden.

source: An unexpected error occurred: %(error)s
de: Ein unerwarteter Fehler ist aufgetreten: %(error)s
